# sudo chown -R $(whoami) /usr/local
# sudo chown -R $(whoami) $(brew --prefix)/*
cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "telemachus/brew", "https://telemachus@bitbucket.org/telemachus/brew.git", pin: true
#
brew "git"
brew "node"
brew "nvm"
brew "mongodb"
brew "postgresql"
brew "mysql"
brew "redis"
brew "ack"
brew "autojump"
brew "go"
brew "tree"
brew "yarn"
brew "vim"
brew "wget"
brew "cloc"
brew "ccat"
brew "bat"
brew "git-flow"
brew "git-extras"
brew "diff-so-fancy"
brew "hub"
brew "htop"
#
cask "google-chrome"
cask "firefox"
cask "hyper"
cask "visual-studio-code"
cask "teamviewer"
cask "iterm2"
cask "skim"
cask "docker"
cask "docker-toolbox"
cask "shadowsocksx-ng"
cask "appcleaner"
cask "evernote"
cask "qq"
cask "the-unarchiver"
cask "iina"
cask "ticktick"
cask "robo-3t"
cask "postman"
cask "android-file-transfer"
cask "typora"
cask "tunnelblick"
cask "neteasemusic"
cask "aerial"
cask "free-download-manager"
cask "go2shell"
#
mas "Sip", id: 507257563
mas "WeChat", id: 836500024
mas "TickTick", id: 966085870
mas "Kindle", id: 40539919